---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures
source: html/2d7e4353-c24a-38d5-f3aa-3cbc2cb92698.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures

Failures about JoinElements.

## Syntax (C#)
```csharp
public static class JoinElementsFailures
```